//=====================================================================
//
// editorblock.cppのヘッダファイル [editorblock.h]
// Author : Kaito Iwasaki
// 
//=====================================================================
#ifndef _EDITORBLOCK_H_
#define _EDITORBLOCK_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "baseObject.h"
#include "main.h"
#include "block.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_BLOCK_PARAM		(4)

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	BASEOBJECT obj;
	BLOCK_TYPE type;
}EDITORBLOCK;

typedef struct
{
	BLOCK_TYPE type;				// ブロックの種類
	int nParam[MAX_BLOCK_PARAM];	// ブロックのパラメータ
}MAPINFO;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitEditorBlock(void);
void UninitEditorBlock(void);
void UpdateEditorBlock(void);
void DrawEditorBlock(void);
EDITORBLOCK* GetEditorBlock(void);
EDITORBLOCK* SetEditorBlock(BLOCK_TYPE type, int x, int y);


#endif