//=====================================================================
// 
// enemy.cppのヘッダファイル [enemy.h]
// Author:
//
//=====================================================================
#ifndef _ENEMY_H_
#define _ENEMY_H_		// 二重インクルード防止のマクロ

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"
#include "block.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_ENEMY		(256)

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************
typedef enum
{
	ENEMY_TYPE_000 = 0,
	ENEMY_TYPE_MAX
}ENEMY_TYPE;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	BASEOBJECT obj;
	bool bUsed;
	D3DXVECTOR3 posOld;
	D3DXVECTOR3 move;
	D3DXVECTOR3 hitBoxSize;
	int nCounterAnim;
	int nPatternAnimX;
	int nPatternAnimY;
	bool bIsJumping;
	BLOCK* pBlock;
}ENEMY;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);
ENEMY* SetEnemy(ENEMY_TYPE type, D3DXVECTOR3 pos);

#endif