//=====================================================================
//
// Tutorial.cppのヘッダファイル [Tutorial.h]
// Author : 
// 
//=====================================================================
#ifndef _Tutorial_H_
#define _Tutorial_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************
typedef enum
{
	TUTORIALSTATE_NORMAL = 0,
	TUTORIALSTATE_CLEAR,
	TUTORIALSTATE_END,
	TUTORIALSTATE_MAX
}TUTORIALSTATE;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);
void SetTutorialState(TUTORIALSTATE state);
void TogglePauseTutorial(bool bIsPause);

#endif